# 데이터프레임 연결

- 서로 다른 데이터프레임들의 구성 형태와 속성이 균일하다면 데이터프레임을 이어 붙여도 데이터의 일관성을 유지할 수 있음
- 기존 데이터프레임의 형태를 유지하면서 이어 붙일 때는 concat() 함수를 활용

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"A" : ["a0", "a1", "a2"],
                    "B" : ["b0", "b1", "b2"],
                    "C" : ["c0", "C1", "C2"]})
df2 = pd.DataFrame({"A" : ["a3", "a4", "a5"],
                    "B" : ["b3", "b4", "b5"],
                    "C" : ["c3", "C4", "C5"]})

In [3]:
df2

    A   B   C
0  a3  b3  c3
1  a4  b4  C4
2  a5  b5  C5

In [4]:
df1

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2

In [5]:
# 2개의 데이터프레임을 행 방향으로 연결
pd.concat([df1, df2], axis = 0)

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2
0  a3  b3  c3
1  a4  b4  C4
2  a5  b5  C5

In [8]:
pd.concat([df1, df2])

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2
0  a3  b3  c3
1  a4  b4  C4
2  a5  b5  C5

In [9]:
# 기존 행 인덱스를 무시하고 새로운 행 인덱스를 설정
pd.concat([df1, df2], axis = 0, ignore_index = True)

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2
3  a3  b3  c3
4  a4  b4  C4
5  a5  b5  C5

In [10]:
# 2개의 데이터프레임을 열 방향으로 연결
pd.concat([df1, df2], axis = 1)

    A   B   C   A   B   C
0  a0  b0  c0  a3  b3  c3
1  a1  b1  C1  a4  b4  C4
2  a2  b2  C2  a5  b5  C5

In [11]:
# 시리즈와 데이터프레임 연결
new_row = pd.Series(["n0", "n1", "n2"])

In [12]:
new_row

0    n0
1    n1
2    n2
dtype: object

In [13]:
pd.concat([df1, new_row], axis = 0)

     A    B    C    0
0   a0   b0   c0  NaN
1   a1   b1   C1  NaN
2   a2   b2   C2  NaN
0  NaN  NaN  NaN   n0
1  NaN  NaN  NaN   n1
2  NaN  NaN  NaN   n2

- 시리즈에는 열 이름이 없기 때문에 새로운 열로 간주

In [15]:
new_row_df = pd.DataFrame([["n0", "n1", "n2"]], columns = ["A", "B", "C"])
new_row_df

    A   B   C
0  n0  n1  n2

In [17]:
pd.concat([df1, new_row_df], axis = 0)

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2
0  n0  n1  n2

In [18]:
pd.concat([df1, new_row], axis = 1)

    A   B   C   0
0  a0  b0  c0  n0
1  a1  b1  C1  n1
2  a2  b2  C2  n2

## 공토 열과 공통 인덱스만 연결하기

In [19]:
df2.columns = ["B", "C", "D"]

In [20]:
df1

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2

In [21]:
df2

    B   C   D
0  a3  b3  c3
1  a4  b4  C4
2  a5  b5  C5

In [22]:
pd.concat([df1,df2], axis = 0)

     A   B   C    D
0   a0  b0  c0  NaN
1   a1  b1  C1  NaN
2   a2  b2  C2  NaN
0  NaN  a3  b3   c3
1  NaN  a4  b4   C4
2  NaN  a5  b5   C5

In [23]:
# 데이터프레임을 공통 열만 연결
pd.concat([df1, df2], join = "inner")

    B   C
0  b0  c0
1  b1  C1
2  b2  C2
0  a3  b3
1  a4  b4
2  a5  b5

In [24]:
df2.index = [1, 2, 3]

In [25]:
df1

    A   B   C
0  a0  b0  c0
1  a1  b1  C1
2  a2  b2  C2

In [26]:
df2

    B   C   D
1  a3  b3  c3
2  a4  b4  C4
3  a5  b5  C5

In [27]:
pd.concat([df1, df2], axis = 1)

     A    B    C    B    C    D
0   a0   b0   c0  NaN  NaN  NaN
1   a1   b1   C1   a3   b3   c3
2   a2   b2   C2   a4   b4   C4
3  NaN  NaN  NaN   a5   b5   C5

In [28]:
pd.concat([df1, df2], axis = 1, join = "inner")

    A   B   C   B   C   D
1  a1  b1  C1  a3  b3  c3
2  a2  b2  C2  a4  b4  C4

In [29]:
# 시리즈와 시리즈 연결
sr1 = pd.Series(["d0", "d1", "d2"])

In [30]:
# new_row와 sr1을 행 방향으로 연결
pd.concat([new_row, sr1], axis = 0)

0    n0
1    n1
2    n2
0    d0
1    d1
2    d2
dtype: object

In [33]:
# new_row와 sr1을 열 방향으로 연결
pd.concat([new_row, sr1], axis = 1)

    0   1
0  n0  d0
1  n1  d1
2  n2  d2